## Soal 1 - PyMySQL - Sakila Databas

In [1]:
import pandas as pd
import mysql.connector

In [2]:
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = '22081995',
    database = 'sakila'
)

In [3]:
mycursor = mydb.cursor()
mycursor.execute('''
show full tables;
''')
myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

              Tables_in_sakila  Table_type
0                        actor  BASE TABLE
1                   actor_info        VIEW
2                      address  BASE TABLE
3                     category  BASE TABLE
4                         city  BASE TABLE
5                      country  BASE TABLE
6                     customer  BASE TABLE
7                customer_list        VIEW
8                         film  BASE TABLE
9                   film_actor  BASE TABLE
10               film_category  BASE TABLE
11                   film_list        VIEW
12                   film_text  BASE TABLE
13                   inventory  BASE TABLE
14                    language  BASE TABLE
15  nicer_but_slower_film_list        VIEW
16                     payment  BASE TABLE
17                      rental  BASE TABLE
18      sales_by_film_category        VIEW
19              sales_by_store        VIEW
20                       staff  BASE TABLE
21                  staff_list        VIEW
22                       store  BASE TABLE

### 1. Tampilkan daftar 10 film komedi dengan durasi tersingkat. Urutkan data berdasarkan film dengan urasi terpendek. Kolom yang diwajibkan tampil adalah title, category dan length.

In [10]:
mycursor = mydb.cursor()
mycursor.execute('''
select film.title as title, category.name as category, film.length as length from category, film, film_category
where category.name = 'Comedy' and category.category_id = film_category.category_id and film_category.film_id = film.film_id
order by length limit 10;
''')
myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

#LINE 1   --> Mengambil data dari table FILM kolom TITLE, table CATEGORY kolom NAME, dan tabel CATEGORY kolom LENGTH.
#LINE 2-3 --> Mencari NAME dari tabel CATEGORY yang memiliki nilai 'COMEDY' dan mencocokkan CATEGORY_ID dari tabel CATEGORY dengan CATEGORY_ID dari tabel FILM_CATEGORY dan terakhir mencocokkan FILM_ID pada FILM_CATEGORY dengan FILM_ID pada tabel FILM
#LINE 4   --> Mengurutkan nilai berdasarkan kolom LENGTH dan di beri limit 10 untuk menampilkan 10 buah baris

              title category  length
0   DOWNHILL ENOUGH   Comedy      47
1  PARADISE SABRINA   Comedy      48
2    HEAVEN FREEDOM   Comedy      48
3  HURRICANE AFFAIR   Comedy      49
4        LION UNCUT   Comedy      50
5         ZORRO ARK   Comedy      50
6       CLOSER BANG   Comedy      58
7   AIRPLANE SIERRA   Comedy      62
8   LONELY ELEPHANT   Comedy      67
9      DOOM DANCING   Comedy      68

In [11]:
mycursor = mydb.cursor()
mycursor.execute('''
select * from category limit 3;
''')
myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

   category_id       name         last_update
0            1     Action 2006-02-15 04:46:27
1            2  Animation 2006-02-15 04:46:27
2            3   Children 2006-02-15 04:46:27

In [12]:
mycursor = mydb.cursor()
mycursor.execute('''
select * from film limit 3;
''')
myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Deleted Scenes, Behind the Scenes}",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"{Deleted Scenes, Trailers}",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"{Deleted Scenes, Trailers}",2006-02-15 05:03:42

In [13]:
mycursor = mydb.cursor()
mycursor.execute('''
select * from film_category limit 3;
''')
myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

   film_id  category_id         last_update
0        1            6 2006-02-15 05:07:09
1        2           11 2006-02-15 05:07:09
2        3            6 2006-02-15 05:07:09

In [20]:
mycursor = mydb.cursor()
mycursor.execute('''
select * from rental limit 3;
''')
myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53

In [21]:
mycursor = mydb.cursor()
mycursor.execute('''
select * from payment limit 3;
''')
myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30
2,3,1,1,1185,5.99,2005-06-15 00:54:12,2006-02-15 22:12:30

In [22]:
mycursor = mydb.cursor()
mycursor.execute('''
select * from inventory limit 3;
''')
myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

   inventory_id  film_id  store_id         last_update
0             1        1         1 2006-02-15 05:09:17
1             2        1         1 2006-02-15 05:09:17
2             3        1         1 2006-02-15 05:09:17

### 2. Tampilkan daftar lengkap kategori film beserta jumlah film tiap kategori & rata-rata harga sewa DVD film tiap kategori. Urutkan data dari kategori dengan jumlah film terbanyak. Kolom yang diwajibkan ada minimal adalah kategori, jumlah film dan rata-rata harga sewa.

In [43]:
mycursor = mydb.cursor()
mycursor.execute('''
select category.name as kategori, count(film.title) as jumlahMovie, avg(payment.amount) as rataHargaSewa
from category, film, film_category, payment, rental, inventory
where category.category_id = film_category.category_id and film_category.film_id = film.film_id and payment.rental_id = rental.rental_id and rental.inventory_id = inventory.inventory_id and inventory.film_id = film_category.film_id
group by kategori;
''')
myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

       kategori  jumlahMovie rataHargaSewa
0        Action         1112      3.935117
1     Animation         1166      3.993396
2      Children          945      3.868307
3      Classics          939      3.876028
4        Comedy          941      4.658427
5   Documentary         1050      4.016686
6         Drama         1060      4.327726
7        Family         1096      3.855903
8       Foreign         1033      4.134240
9         Games          969      4.418297
10       Horror          846      4.400165
11        Music          830      4.117735
12          New          940      4.629383
13       Sci-Fi         1101      4.320599
14       Sports         1179      4.507388
15       Travel          837      4.240908

In [37]:
mycursor = mydb.cursor()
mycursor.execute('''
select * from film limit 3;
''')
myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Deleted Scenes, Behind the Scenes}",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"{Deleted Scenes, Trailers}",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"{Deleted Scenes, Trailers}",2006-02-15 05:03:42

In [34]:
mycursor = mydb.cursor()
mycursor.execute('''
select * from actor limit 3;
''')
myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

   actor_id first_name last_name         last_update
0         1   PENELOPE   GUINESS 2006-02-15 04:34:33
1         2       NICK  WAHLBERG 2006-02-15 04:34:33
2         3         ED     CHASE 2006-02-15 04:34:33

In [36]:
mycursor = mydb.cursor()
mycursor.execute('''
select * from film_actor limit 3;
''')
myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

   actor_id  film_id         last_update
0         1        1 2006-02-15 05:05:03
1         1       23 2006-02-15 05:05:03
2         1       25 2006-02-15 05:05:03

### 3. Tampilkan daftar 10 aktor/aktris yang paling banyak membintangi film. Kolom yang ditampilkan minimal: id aktor, nama depan, nama belakang dan jumlah film yang dibintangi. Kemudian urutkan dari aktor/aktris yang membintangi film terbanyak.

In [59]:
mycursor = mydb.cursor()
mycursor.execute('''
select actor.actor_id as actor_id, actor.first_name as first_name, actor.last_name as last_name, count(film_actor.film_id) as jumlahMovie
from actor, film, film_actor
where actor.actor_id = film_actor.actor_id and film_actor.film_id = film.film_id
group by actor_id
order by jumlahMovie desc
limit 10;
''')
myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

   actor_id first_name  last_name  jumlahMovie
0       107       GINA  DEGENERES           42
1       102     WALTER       TORN           41
2       198       MARY     KEITEL           40
3       181    MATTHEW     CARREY           39
4        23     SANDRA     KILMER           37
5        81   SCARLETT      DAMON           36
6        37        VAL     BOLGER           35
7       158     VIVIEN   BASINGER           35
8       106    GROUCHO      DUNST           35
9        13        UMA       WOOD           35

### 4.Dari soal sebelumnya diketahui Gina Degeneres merupakan aktris yang paling banyak membintangi film, dengan total 42 judul film. Kategori film apakah yang paling banyak dibintanginya? Untuk mengetahuinya, tampilkan daftar kategori film beserta jumlah film yang pernah dibintangi oleh Gina Degeneres.

In [60]:
mycursor = mydb.cursor()
mycursor.execute('''
select * from category limit 3;
''')
myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

   category_id       name         last_update
0            1     Action 2006-02-15 04:46:27
1            2  Animation 2006-02-15 04:46:27
2            3   Children 2006-02-15 04:46:27

In [61]:
mycursor = mydb.cursor()
mycursor.execute('''
select * from film limit 3;
''')
myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Deleted Scenes, Behind the Scenes}",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"{Deleted Scenes, Trailers}",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"{Deleted Scenes, Trailers}",2006-02-15 05:03:42

In [62]:
mycursor = mydb.cursor()
mycursor.execute('''
select * from film_actor limit 3;
''')
myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

   actor_id  film_id         last_update
0         1        1 2006-02-15 05:05:03
1         1       23 2006-02-15 05:05:03
2         1       25 2006-02-15 05:05:03

In [63]:
mycursor = mydb.cursor()
mycursor.execute('''
select * from film_category limit 3;
''')
myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

   film_id  category_id         last_update
0        1            6 2006-02-15 05:07:09
1        2           11 2006-02-15 05:07:09
2        3            6 2006-02-15 05:07:09

In [65]:
mycursor = mydb.cursor()
mycursor.execute('''
select category.name as category, count(film.title) from category, film, actor, film_category, film_actor
where film_actor.actor_id = 107 and film_category.category_id = category.category_id 
group by category;
''')
myresult = mycursor.fetchall()
#myresult
columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

       category  count(film.title)
0   Documentary             600000
1       Foreign             400000
2         Music             800000
3           New             200000
4        Sci-Fi            1400000
5        Action             600000
6         Drama             400000
7     Animation             800000
8        Horror             200000
9        Family             800000
10       Comedy             600000
11     Children             400000
12     Classics             400000
13       Sports             400000
14        Games             200000
15       Travel             200000

### 5. Dari soal sebelumnya diketahui Gina Degeneres paling banyak membintangi film bergenre sciencefiction, dengan total 7 judul film. Tampilkan daftar judul film sci-fi yang pernah dibintangi oleh Gina Degeneres. Kolom yang diwajibkan ada yaitu judul film dan kategorinya.